<div style="text-align: center; background-color: #5A96E3; font-family: 'Trebuchet MS', Arial, sans-serif; color: white; padding: 20px; font-size: 40px; font-weight: bold; border-radius: 0 0 0 0; box-shadow: 0px 6px 8px rgba(0, 0, 0, 0.2);">
  Visualize Data
</div>

In [46]:
import pandas as pd
import numpy as np

## Read data

In [35]:
annual_pop_df = pd.read_csv("../data/processed/preprocess_OA.csv")

agri_employ_df = pd.read_csv("../data/processed/preprocess_OEA.csv")

rural_employ_df = pd.read_csv("../data/processed/preprocess_OER.csv")

products_df = pd.read_csv("../data/processed/preprocess_QV.csv")

values_df = pd.read_csv("../data/processed/preprocess_QCL.csv")

In [36]:
display(annual_pop_df.head(3))
display(agri_employ_df.head(3))
display(rural_employ_df.head(3))
display(values_df.head(3))
display(products_df.head(3))

,Domain Code,Area Code,Element Code,Element,Item Code,Year,Unit,Value,Flag,Note
0,OA,237,511,Total Population - Both sexes,3010,1950,1000 No,25109.200,X,NaN
1,OA,237,512,Total Population - Male,3010,1950,1000 No,12408.031,X,NaN
2,OA,237,513,Total Population - Female,3010,1950,1000 No,12701.169,X,NaN

,Domain Code,Area Code,Indicator Code,Sex Code,Sex,Year,Element Code,Element,Source Code,Unit,Value,Flag,Note
0,OEA,237,21144,1,Total,1991,6199,Value,3043,1000 No,24059.27,X,NaN
1,OEA,237,21144,1,Total,1992,6199,Value,3043,1000 No,24384.94,X,NaN
2,OEA,237,21144,1,Total,1993,6199,Value,3043,1000 No,24641.43,X,NaN

,Domain Code,Area,Indicator Code,Sex Code,Sex,Year,Element Code,Element,Source Code,Unit,Value,Flag,Note
0,OER,Viet Nam,21087,1,Total,2007,6199,Value,3023,1000 No,34098.44,X,Break in series: Methodology revised Repositor...
1,OER,Viet Nam,21087,1,Total,2009,6199,Value,3023,1000 No,34615.17,X,Repository: ILO-STATISTICS - Micro data proces...
2,OER,Viet Nam,21087,1,Total,2010,6199,Value,3023,1000 No,35839.50,X,Repository: ILO-STATISTICS - Micro data proces...

,Domain Code,Area Code,Element Code,Element,Item Code,Year,Unit,Value,Flag
0,QV,237,152,Gross Production Value (constant 2014-2016 tho...,711,1961,1000 Int. $,1521,E
1,QV,237,152,Gross Production Value (constant 2014-2016 tho...,711,1962,1000 Int. $,1521,E
2,QV,237,152,Gross Production Value (constant 2014-2016 tho...,711,1963,1000 Int. $,1521,E

,Domain Code,Area Code,Element Code,Element,Item Code,Year,Unit,Value,Flag,Note
0,QCL,237,5312,Area harvested,711,1961,ha,1000.0,E,NaN
1,QCL,237,5419,Yield,711,1961,100 g/ha,7000.0,E,NaN
2,QCL,237,5510,Production,711,1961,t,700.0,E,NaN

### Correlation between total population and production of each item each year

In [44]:
product = products_df['Item Code'].unique()

In [51]:
products_df[products_df[['Year', 'Item Code']] == [2020, product[0]]]

,Domain Code,Area Code,Element Code,Element,Item Code,Year,Unit,Value,Flag,Note
0,NaN,NaN,NaN,NaN,711.0,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,711.0,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,711.0,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,711.0,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,711.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
15065,NaN,NaN,NaN,NaN,NaN,2020.0,NaN,NaN,NaN,NaN
15066,NaN,NaN,NaN,NaN,NaN,2020.0,NaN,NaN,NaN,NaN
15067,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15068,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15069,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [38]:
# products_df[products_df['Item']]
annual_pop_df[annual_pop_df['Element'] == 'Total Population - Both sexes'][annual_pop_df['Year'] == 2020]['Value'].values[0]

C:\Users\THINKPAD\AppData\Local\Temp\ipykernel_2888\160982024.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  annual_pop_df[annual_pop_df['Element'] == 'Total Population - Both sexes'][annual_pop_df['Year'] == 2020]['Value'].values[0]

96648.685